In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series

pandas.core.series.Series

In [3]:
my_index =["USA","CANADA","MEXICO"]

In [4]:
my_data=[1776,1867,1821]

In [5]:
my_series =pd.Series(data=my_data,index=my_index)

In [6]:
my_series

USA       1776
CANADA    1867
MEXICO    1821
dtype: int64

In [7]:
my_series[2]

1821

In [8]:
ages={"SAM":5,
      "FRANK":10,
      "SPIKE":7}

In [9]:
pd.Series(ages)

SAM       5
FRANK    10
SPIKE     7
dtype: int64

In [10]:
# Imaginary Sales Data for 1st and 2nd Quarters for Global Company
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}

In [11]:
sales_q1=pd.Series(q1)
sales_q2=pd.Series(q2)

In [12]:
sales_q1,sales_q2

(Japan     80
 China    450
 India    200
 USA      250
 dtype: int64, Brazil    100
 China     500
 India     210
 USA       260
 dtype: int64)

In [13]:
sales_q1["Japan"]

80

In [14]:
sales_q1[1]

450

In [15]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [16]:
np.array([1,2]) *2

array([2, 4])

In [17]:
sales_q1*2

Japan    160
China    900
India    400
USA      500
dtype: int64

In [18]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [19]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [20]:
total_sales=sales_q1+sales_q2
total_sales

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [21]:
sales_q1.add(sales_q2,fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [22]:
pd.Series

pandas.core.series.Series

In [23]:
np.random.seed(101)
my_data=np.random.randint(0,101,(4,3))
my_data

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [24]:
my_index =["CA","NY","AZ","TX"]
my_columns=["JAN","FEB","MAR"]

In [25]:
df=pd.DataFrame(my_data)
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [26]:
df=pd.DataFrame(data=my_data,index=my_index)
df

     0   1   2
CA  95  11  81
NY  70  63  87
AZ  75   9  77
TX  40   4  63

In [27]:
df=pd.DataFrame(data=my_data,index=my_index,columns=my_columns)
df

    JAN  FEB  MAR
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   JAN     4 non-null      int64
 1   FEB     4 non-null      int64
 2   MAR     4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [29]:
FILEPATH="/content/drive/MyDrive/Reinforcement Learning/DATA/tips.csv"

In [30]:
df=pd.read_csv(FILEPATH)
df

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
..          ...   ...     ...  ...                 ...               ...        ...
239       29.03  5.92    Male  ...       Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...     Michelle Hardin  3511451626698139    Thur672

[244 rows x 11 columns]

In [31]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [32]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [33]:
df.head()

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

In [34]:
df["total_bill"]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [35]:
my_cols=["total_bill","tip"]
df[my_cols]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [36]:
df["tip"] /df["total_bill"]

0      0.059447
1      0.160542
2      0.166587
3      0.139780
4      0.146808
         ...
239    0.203927
240    0.073584
241    0.088222
242    0.098204
243    0.159744
Length: 244, dtype: float64

In [37]:
df["tip_percentage"] =100*df["tip"] /df["total_bill"]

In [38]:
df

     total_bill   tip     sex  ...         CC Number Payment ID tip_percentage
0         16.99  1.01  Female  ...  3560325168603410    Sun2959       5.944673
1         10.34  1.66    Male  ...  4478071379779230    Sun4608      16.054159
2         21.01  3.50    Male  ...  6011812112971322    Sun4458      16.658734
3         23.68  3.31    Male  ...  4676137647685994    Sun5260      13.978041
4         24.59  3.61  Female  ...  4832732618637221    Sun2251      14.680765
..          ...   ...     ...  ...               ...        ...            ...
239       29.03  5.92    Male  ...  5296068606052842    Sat2657      20.392697
240       27.18  2.00  Female  ...  3506806155565404    Sat1766       7.358352
241       22.67  2.00    Male  ...  6011891618747196    Sat3880       8.822232
242       17.82  1.75    Male  ...     4375220550950      Sat17       9.820426
243       18.78  3.00  Female  ...  3511451626698139    Thur672      15.974441

[244 rows x 12 columns]

In [39]:
df= df.set_index("Payment ID")

In [40]:
df

            total_bill   tip  ...         CC Number tip_percentage
Payment ID                    ...
Sun2959          16.99  1.01  ...  3560325168603410       5.944673
Sun4608          10.34  1.66  ...  4478071379779230      16.054159
Sun4458          21.01  3.50  ...  6011812112971322      16.658734
Sun5260          23.68  3.31  ...  4676137647685994      13.978041
Sun2251          24.59  3.61  ...  4832732618637221      14.680765
...                ...   ...  ...               ...            ...
Sat2657          29.03  5.92  ...  5296068606052842      20.392697
Sat1766          27.18  2.00  ...  3506806155565404       7.358352
Sat3880          22.67  2.00  ...  6011891618747196       8.822232
Sat17            17.82  1.75  ...     4375220550950       9.820426
Thur672          18.78  3.00  ...  3511451626698139      15.974441

[244 rows x 11 columns]

In [41]:
df.iloc[0]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
tip_percentage                 5.94467
Name: Sun2959, dtype: object

In [42]:
df.loc["Sat2657"]

total_bill                     29.03
tip                             5.92
sex                             Male
smoker                            No
day                              Sat
time                          Dinner
size                               3
price_per_person                9.68
Payer Name             Michael Avila
CC Number           5296068606052842
tip_percentage               20.3927
Name: Sat2657, dtype: object

In [43]:
df.iloc[0:5]

            total_bill   tip  ...         CC Number tip_percentage
Payment ID                    ...
Sun2959          16.99  1.01  ...  3560325168603410       5.944673
Sun4608          10.34  1.66  ...  4478071379779230      16.054159
Sun4458          21.01  3.50  ...  6011812112971322      16.658734
Sun5260          23.68  3.31  ...  4676137647685994      13.978041
Sun2251          24.59  3.61  ...  4832732618637221      14.680765

[5 rows x 11 columns]

In [47]:
df.loc[["Sun2959","Sun5260"]]

            total_bill   tip  ...         CC Number tip_percentage
Payment ID                    ...
Sun2959          16.99  1.01  ...  3560325168603410       5.944673
Sun5260          23.68  3.31  ...  4676137647685994      13.978041

[2 rows x 11 columns]